'''
Перечислить методы списка (list)
Написать их через запятую с параметрами
Отсортировать методы по частоте использования (по вашему мнению)
Прокомментировать свой выбор
'''

# Уже отсортировал. Сортировал по частоте использования мной. Кто-то, вероятно, другие чаще использует.
methods=['append','sort','reverse','map','filter','insert','remove','pop','index','extend','clear']
# Чтобы посмотреть параметры метода, достаточно написать любой метод действующего списка, и, выделив его, нажать
# ctrl+пробел для справки
#methods.append() + ctrl+пробел или так:
help(methods)